package hyj.tool.data;
 
import java.util.Random;

/**
 * https://blog.csdn.net/qq_42461639/article/details/82291078
 *
 */
public class NameBuilder {
 
	private static String[] xings = {"赵","钱","孙","李","周","吴","郑","王","冯","陈","褚","卫","蒋","沈","韩","杨","朱","秦","尤","许",

			"何","吕","施","张","孔","曹","严","华","金","魏","陶","姜","戚","谢","邹","喻","柏","水","窦","章","云","苏","潘","葛","奚","范","彭","郎",

			"鲁","韦","昌","马","苗","凤","花","方","俞","任","袁","柳","酆","鲍","史","唐","费","廉","岑","薛","雷","贺","倪","汤","滕","殷",

			"罗","毕","郝","邬","安","常","乐","于","时","傅","皮","卞","齐","康","伍","余","元","卜","顾","孟","平","黄","和",

			"穆","萧","尹","姚","邵","湛","汪","祁","毛","禹","狄","米","贝","明","臧","计","伏","成","戴","谈","宋","茅","庞","熊","纪","舒",

			"屈","项","祝","董","梁","杜","阮","蓝","闵","席","季","麻","强","贾","路","娄","危","江","童","颜","郭","梅","盛","林","刁","钟",

			"徐","邱","骆","高","夏","蔡","田","樊","胡","凌","霍","虞","万","支","柯","昝","管","卢","莫","经","房","裘","缪","干","解","应",

			"宗","丁","宣","贲","邓","郁","单","杭","洪","包","诸","左","石","崔","吉","钮","龚","程","嵇","邢","滑","裴","陆","荣","翁","荀",

			"羊","于","惠","甄","曲","家","封","芮","羿","储","靳","汲","邴","糜","松","井","段","富","巫","乌","焦","巴","弓","牧","隗","山",

			"谷","车","侯","宓","蓬","全","郗","班","仰","秋","仲","伊","宫","宁","仇","栾","暴","甘","钭","厉","戎","祖","武","符","刘","景",

			"詹","束","龙","叶","幸","司","韶","郜","黎","蓟","溥","印","宿","白","怀","蒲","邰","从","鄂","索","咸","籍","赖","卓","蔺","屠",

			"蒙","池","乔","阴","郁","胥","能","苍","双","闻","莘","党","翟","谭","贡","劳","逄","姬","申","扶","堵","冉","宰","郦","雍","却",

			"璩","桑","桂","濮","牛","寿","通","边","扈","燕","冀","浦","尚","农","温","别","庄","晏","柴","瞿","阎","充","慕","连","茹","习",

			"宦","艾","鱼","容","向","古","易","慎","戈","廖","庾","终","暨","居","衡","步","都","耿","满","弘","匡","国","文","寇","广","禄",

			"阙","东","欧","殳","沃","利","蔚","越","夔","隆","师","巩","厍","聂","晁","勾","敖","融","冷","訾","辛","阚","那","简","饶","空",

			"曾","毋","沙","乜","养","鞠","须","丰","巢","关","蒯","相","查","后","荆","红","游","郏","竺","权","逯","盖","益","桓","公","仉",

			"督","岳","帅","缑","亢","况","郈","有","琴","归","海","晋","楚","闫","法","汝","鄢","涂","钦","商","牟","佘","佴","伯","赏","墨",

			"哈","谯","篁","年","爱","阳","佟","言","福","南","火","铁","迟","漆","官","冼","真","展","繁","檀","祭","密","敬","揭","舜","楼",

			"疏","冒","浑","挚","胶","随","高","皋","原","种","练","弥","仓","眭","蹇","覃","阿","门","恽","来","綦","召","仪","风","介","巨",

			"木","京","狐","郇","虎","枚","抗","达","杞","苌","折","麦","庆","过","竹","端","鲜","皇","亓","老","是","秘","畅","邝","还","宾",

			"闾","辜","纵","侴","万俟","司马","上官","欧阳","夏侯","诸葛","闻人","东方","赫连","皇甫","羊舌","尉迟","公羊","澹台","公冶","宗正",

			"濮阳","淳于","单于","太叔","申屠","公孙","仲孙","轩辕","令狐","钟离","宇文","长孙","慕容","鲜于","闾丘","司徒","司空","兀官","司寇",

			"南门","呼延","子车","颛孙","端木","巫马","公西","漆雕","车正","壤驷","公良","拓跋","夹谷","宰父","谷梁","段干","百里","东郭","微生",

			"梁丘","左丘","东门","西门","南宫","第五","公仪","公乘","太史","仲长","叔孙","屈突","尔朱","东乡","相里","胡母","司城","张廖","雍门",

			"毋丘","贺兰","綦毋","屋庐","独孤","南郭","北宫","王孙"};;
	private static String mings = "碧凡、夏菡、曼香、若烟、半梦、雅绿、冰蓝、灵槐、平安、书翠、翠风、香巧、代云、" + "友巧、听寒、梦柏、醉易、访旋、亦玉、凌萱、访卉、怀亦、笑蓝、春翠、靖柏、书雪、"
			+ "乐枫、念薇、靖雁、寻春、恨山、从寒、忆香、觅波、静曼、凡旋、新波、代真、新蕾、" + "雁玉、冷卉、紫山、千琴、恨天、傲芙、盼山、怀蝶、冰兰、问旋、从南、白易、问筠、"
			+ "如霜、半芹、寒雁、怜云、寻文、谷雪、乐萱、涵菡、海莲、傲蕾、青槐、冬儿、易梦、" + "惜雪、宛海、之柔、夏青";
	private static Random r = new Random();
 
	/**
	 * 使用指定的姓氏，用xings里面的字，随机生成姓名
	 * @param xing		指定姓氏
	 * @param length	指定名字总长度
	 * @return
	 */
	public static String build(String xing, int length) {
		// 定义姓名
		String xingming = xing;
 
		//创建随机对象
		Random r = new Random();
 
		while (xingming.length() < length) {
			// 从名字符串中随机取出一个字符的编号
			int index = r.nextInt(mings.length());
			// 从名字字符串中取一个字
			String s = mings.substring(index, index + 1);
			// 如果s是顿号，就重新再取一次（使用常量比变量，这是推荐的方式）
			if ("、".equals(s)) {
				continue;
			} else {
				//将名 加到 姓名中取
				xingming += s;
			}
		}
		return xingming;
	}
 
	/**
	 * 使用xings里面姓氏，用xings里面的字，随机生成姓名
	 * @param length 指定名字总长度
	 * @return
	 */
	public static String build(int length) {
		// 判断姓名的长度必须大于 2
		if (length < 2) {
			System.out.println("姓名不能少于2个字符");
			return null;
		}
		/**
		 * 因为有些姓氏不能拆分（如：复姓），因此选姓氏不能像选名字那样一个一个字选
		 * 因此要将xings转成数组
		 */
		// 先随机选姓氏
		Random r = new Random();

		int index = r.nextInt(xings.length);
		String xing = xings[index];
 
		// 有了姓氏，再调用上面的选名字的方法，就OK了
		return build(xing, length);
	}
 
	/**
	 * 随机生成2~3个字的名字
	 * @return
	 */
	public static String build() {
		int length = r.nextInt(2) + 2;
		return build(length);
	}
 
	public static void main(String[] args) {
		System.out.println("\r\n指定姓氏造100个3个字的名字");
		for (int i = 0; i < 100; i++) {
			System.out.print(build("廖", 3) + "，");
			if ((i + 1) % 10 == 0) {
				System.out.println();
			}
		}
		
		System.out.println("\r\n不指定姓氏造100个3个字的名字");
		for (int i = 0; i < 100; i++) {
			System.out.print(build(3) + "，");
			if ((i + 1) % 10 == 0) {
				System.out.println();
			}
		}
		
		System.out.println("\r\n随机造100个名2~3个字的字");
		for (int i = 0; i < 100; i++) {
			System.out.print(build() + "\t");
			if ((i + 1) % 10 == 0) {
				System.out.println();
			}
		}
 
	}
}